In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [5]:
df = DataFrame({
    'key1':list('aabba'),
    'key2':'one,two,one,two,one'.split(','),
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)
})
df

      data1     data2 key1 key2
0  1.169808  0.405343    a  one
1 -1.511481  2.307448    a  two
2 -0.003950 -0.079773    b  one
3  1.521584  0.282015    b  two
4 -1.207524  0.405578    a  one

In [6]:
# 选取data1数据列按照key1数据列进行分组
grouped = df['data1'].groupby(df['key1'])
grouped

In [7]:
# 调用已经分组好的数据中的一些方法，就能得出相应数据
# 获取分组中每一组数据的平均值
grouped.mean()

key1
a   -0.516399
b    0.758817
Name: data1, dtype: float64

In [16]:
# 选取data1 根据key1和key2两个列数据进行分组, 分组使用顺序不同，得出结果也不同；注意by后面使用顺序
grouped1 = df['data1'].groupby([df['key1'],df['key2']])
grouped2 = df['data1'].groupby([df['key2'],df['key1']])

In [17]:
# 求平均
grouped1.mean()

key1  key2
a     one    -0.018858
      two    -1.511481
b     one    -0.003950
      two     1.521584
Name: data1, dtype: float64

In [18]:
grouped2.mean()

key2  key1
one   a      -0.018858
      b      -0.003950
two   a      -1.511481
      b       1.521584
Name: data1, dtype: float64

In [22]:
df.groupby([df['key1'],df['key2']]).size() # 计算分组后每一组中key1,key2不同组合出现次数

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [25]:
df.groupby(['key1','key2']).size() # 与上面的写法是一致的，说明通过df调用group知道去查询数据字段

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [27]:
# for ...in 循环打印分组的数据
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  1.169808  0.405343    a  one
1 -1.511481  2.307448    a  two
4 -1.207524  0.405578    a  one
b
      data1     data2 key1 key2
2 -0.003950 -0.079773    b  one
3  1.521584  0.282015    b  two

In [32]:
ls1 = list(df.groupby('key1'))
ls1

[('a',       data1     data2 key1 key2
  0  1.169808  0.405343    a  one
  1 -1.511481  2.307448    a  two
  4 -1.207524  0.405578    a  one), ('b',       data1     data2 key1 key2
  2 -0.003950 -0.079773    b  one
  3  1.521584  0.282015    b  two)]

In [34]:
pices = dict(ls1)
pices

{'a':       data1     data2 key1 key2
 0  1.169808  0.405343    a  one
 1 -1.511481  2.307448    a  two
 4 -1.207524  0.405578    a  one, 'b':       data1     data2 key1 key2
 2 -0.003950 -0.079773    b  one
 3  1.521584  0.282015    b  two}

In [35]:
pices['b']

      data1     data2 key1 key2
2 -0.003950 -0.079773    b  one
3  1.521584  0.282015    b  two

In [36]:
# 通过数据类型对列进行分组
df.dtypes # 获取列的类型

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [39]:
dict(list(df .groupby(df.dtypes,axis=1)))

{dtype('float64'):       data1     data2
 0  1.169808  0.405343
 1 -1.511481  2.307448
 2 -0.003950 -0.079773
 3  1.521584  0.282015
 4 -1.207524  0.405578, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [40]:
grouped.size()

key1
a    3
b    2
Name: data1, dtype: int64

In [49]:
# 选择分类数据中的一个或者一组  1，方法1
s_grouped = df.groupby(['key1','key2'])['data2'].mean()
s_grouped
# 2，方法2
df['data2'].groupby([df['key1'],df['key2']]).mean()  # 注意，df[['xxx']]返回dataframe，df['xxx'] 返回的是series
# 3. 方法 3
df.groupby(['key1','key2'])

key1  key2
a     one     0.405460
      two     2.307448
b     one    -0.079773
      two     0.282015
Name: data2, dtype: float64

In [51]:
people = DataFrame(np.random.randn(5,5),columns=list('abcde'),index='Joe,Steve,Wes,Jim,Travis'.split(','))
people

               a         b         c         d         e
Joe     0.298032 -1.434414  0.450624 -0.359406  1.548032
Steve   1.808595  0.256817 -0.487248  2.264868 -0.903259
Wes    -0.636981 -1.696815  0.446201 -0.251137 -1.002064
Jim     0.926445 -0.907618 -0.874757  0.454062  0.665368
Travis  0.429843  0.814553  0.793243  0.908227 -1.417465

In [52]:
# 创建一个将列名称映射字典
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [53]:
by_columns = people.groupby(mapping,axis=1) # 通过映射表对mapping映射对应数据进行分组统计，统计出来的数据
by_columns.sum()

            blue       red
Joe     0.091218  0.411649
Steve   1.777620  1.162153
Wes     0.195064 -3.335860
Jim    -0.420695  0.684196
Travis  1.701470 -0.173068

In [55]:
# 将mapping转为Series
serieMap = Series(mapping)
by_columns1 = people.groupby(serieMap,axis=1) # 通过映射表对mapping映射对应数据进行分组统计，统计出来的数据
by_columns1.sum()
by_columns1.count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [57]:
# 常用的分组后计算方法
dict_obj = {'key1' : ['a', 'b', 'a', 'b', 'a', 'b', 'a', 'a'],
            'key2' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
            'data1': np.random.randint(1,10, 8), 
            'data2': np.random.randint(1,10, 8)}
df = DataFrame(dict_obj)

In [58]:
df

   data1  data2 key1   key2
0      4      9    a    one
1      3      6    b    one
2      4      2    a    two
3      9      7    b  three
4      1      1    a    two
5      4      3    b    two
6      7      1    a    one
7      5      9    a  three

In [61]:
df.groupby('key1').sum()
df.groupby('key1')[['data1']].sum()

      data1
key1
a        21
b        16

In [63]:
df.groupby('key1').max()
# df.groupby('key1')[['data1']].max()

      data1  data2 key2
key1
a         7      9  two
b         9      7  two

In [64]:
df.groupby('key1').min()

      data1  data2 key2
key1
a         1      1  one
b         3      3  one

In [65]:
df.groupby('key1').mean()

         data1     data2
key1
a     4.200000  4.400000
b     5.333333  5.333333

In [66]:
df.groupby('key1').size() # size统计key1中a,b出现的次数

key1
a    5
b    3
dtype: int64

In [67]:
df.groupby('key1').count() # count是根据a,b分组后求其他组的属于a,b的次数

      data1  data2  key2
key1
a         5      5     5
b         3      3     3

In [68]:
df.groupby('key1').describe()

     data1                                              data2            \
     count      mean       std  min  25%  50%  75%  max count      mean
key1
a      5.0  4.200000  2.167948  1.0  4.0  4.0  5.0  7.0   5.0  4.400000
b      3.0  5.333333  3.214550  3.0  3.5  4.0  6.5  9.0   3.0  5.333333


           std  min  25%  50%  75%  max
key1
a     4.219005  1.0  1.0  2.0  9.0  9.0
b     2.081666  3.0  4.5  6.0  6.5  7.0

In [70]:
# 定义函数，获取DataFrame中某一列最大值和最小值之差
def peak_range(df):
    print(type(df))
    return df.max()-df.min()

df.groupby('key1').agg(peak_range)

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

      data1  data2
key1
a         6      8
b         6      4

In [71]:
df.groupby('key1').agg(lambda df:df.max()-df.min())

      data1  data2
key1
a         6      8
b         6      4

In [72]:
# 在egg里面使用多个函数对数据进行处理
df.groupby('key1').agg(['mean','std','count',peak_range]) # agg后面列表中加引号的代表内置的聚合函数

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

         data1                                data2
          mean       std count peak_range      mean       std count peak_range
key1
a     4.200000  2.167948     5          6  4.400000  4.219005     5          8
b     5.333333  3.214550     3          6  5.333333  2.081666     3          4

In [73]:
df.groupby('key1').agg(['mean','std','count',('pr',peak_range)]) # ('pr',peak_range)通过元组给一列函数使用别名

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

         data1                        data2
          mean       std count pr      mean       std count pr
key1
a     4.200000  2.167948     5  6  4.400000  4.219005     5  8
b     5.333333  3.214550     3  6  5.333333  2.081666     3  4

In [74]:
df.groupby('key1').agg([('mm','mean'),'std','count',('pr',peak_range)]) # ('pr',peak_range)通过元组给一列函数使用别名

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

         data1                        data2
            mm       std count pr        mm       std count pr
key1
a     4.200000  2.167948     5  6  4.400000  4.219005     5  8
b     5.333333  3.214550     3  6  5.333333  2.081666     3  4

In [77]:
# 使用字典实现数据的每一列作用不同的聚合函数
dict_mapping = {'data1':'mean',
                'data2':'sum'
               }
df.groupby('key1').agg(dict_mapping)

         data1  data2
key1
a     4.200000     22
b     5.333333     16

In [79]:

df = pd.DataFrame(data={'books':['bk1','bk1','bk1','bk2','bk2','bk3'], 'price': [12,12,12,15,15,17]}) 
df

  books  price
0   bk1     12
1   bk1     12
2   bk1     12
3   bk2     15
4   bk2     15
5   bk3     17

In [81]:
df.groupby('books',as_index=True).sum() # 通过as_index指定books作为索引

       price
books
bk1       36
bk2       30
bk3       17

In [82]:
df.groupby('books',as_index=False).sum() # 通过as_index指定books不作为索引

  books  price
0   bk1     36
1   bk2     30
2   bk3     17